app/Controllers/Dashboard.php

    public function index()
    {
        $data = [
            'qcdoc' => $this->qcdoc->getQcdocAndStatusByUser()->getResultArray(),
            'total_qc' => $this->qcdoc->countAllResults(),
---
SELECT COUNT(*) AS `numrows`
FROM `qcdoc`