app/Models/QcdocModel.php

SELECT `q`.*, `qs`.*, `u`.`fullname` as `pic_name`
FROM `qcdoc` `q`
JOIN `qcdoc_status` `qs` ON `q`.`idQc` = `qs`.`qcId`
JOIN `users` `u` ON `q`.`user_id` = `u`.`id`
WHERE `qs`.`status` = '2'
OR `qs`.`status` = '5'
OR `qs`.`status` = '4'
ORDER BY `qs`.`idStatus` DESC
SELECT `q`.*, `qs`.*, `u`.`fullname` as `pic_name`
FROM `qcdoc` `q`
JOIN `qcdoc_status` `qs` ON `q`.`idQc` = `qs`.`qcId`
JOIN `users` `u` ON `q`.`user_id` = `u`.`id`
ORDER BY `qs`.`idStatus` DESC
---
    function getQcdocAndStatusByUser($userId = null)
    {
        if (in_groups('enguser')) {
            $query = $this->db->table('qcdoc q')
                ->join('qcdoc_status qs', 'q.idQc = qs.qcId')
                ->join('users u', 'q.user_id = u.id')
                ->where('user_id', $userId)
                ->orderBy('qs.idStatus', 'desc')
                ->select('q.*,qs.*, u.fullname as pic_name')
                ->get();
        } else if (in_groups('leader')) {
            $query = $this->db->table('qcdoc q')
                ->join('qcdoc_status qs', 'q.idQc = qs.qcId')
                ->join('users u', 'q.user_id = u.id')
                ->where('qs.status', '1')
                ->orWhere('qs.status', '3')
                ->orderBy('qs.idStatus', 'desc')
                ->select('q.*,qs.*, u.fullname as pic_name')
                ->get();
        } else if (in_groups('manager')) {
            $query = $this->db->table('qcdoc q')
                ->join('qcdoc_status qs', 'q.idQc = qs.qcId')
                ->join('users u', 'q.user_id = u.id')
                ->where('qs.status', '2')
                ->orWhere('qs.status', '5')
                ->orWhere('qs.status', '4')
                ->orderBy('qs.idStatus', 'desc')
                ->select('q.*,qs.*, u.fullname as pic_name')
                ->get();
        } else {
            $query = $this->db->table('qcdoc q')
                ->join('qcdoc_status qs', 'q.idQc = qs.qcId')
                ->join('users u', 'q.user_id = u.id')
                ->orderBy('qs.idStatus', 'desc')
                ->select('q.*,qs.*, u.fullname as pic_name')
                ->get();

SELECT `q`.*, `qs`.*, `u`.`fullname` as `pic_name`
FROM `qcdoc` `q`
JOIN `qcdoc_status` `qs` ON `q`.`idQc` = `qs`.`qcId`
JOIN `users` `u` ON `q`.`user_id` = `u`.`id`
WHERE `q`.`idQc` = '23'
ORDER BY `qs`.`idStatus` DESC
---
    function getQcdocAndStatus($id)
    {
        $query = $this->db->table('qcdoc q')
            ->join('qcdoc_status qs', 'q.idQc = qs.qcId')
            ->join('users u', 'q.user_id = u.id')
            ->where('q.idQc', $id)
            ->orderBy('qs.idStatus', 'desc')
            ->select('q.*, qs.*, u.fullname as pic_name')
            ->get();

SELECT COUNT(*) AS `numrows`
FROM `qcdoc` `q`
JOIN `qcdoc_status` `qs` ON `q`.`idQc` = `qs`.`qcId`
WHERE `qs`.`status` = '1'
---
    function CountQcDocByStatus($status)
    {
        $query = $this->db->table('qcdoc q')
            ->join('qcdoc_status qs', 'q.idQc = qs.qcId')
            ->where('qs.status', $status)
            ->countAllResults();